<?php
/*
 * [共通処理定数定義]
 */
#-------------------------------------
# 絞り込み件数 [あ～わ] リスト
#-------------------------------------
$filterInitialsList = [
	1 => 'あ行',
	2 => 'か行',
	3 => 'さ行',
	4 => 'た行',
	5 => 'な行',
	6 => 'は行',
	7 => 'ま行',
	8 => 'や行',
	9 => 'ら行',
	10 => 'わ行'
];

#-------------------------------------
# ページャー表示最大数
#-------------------------------------
$pagerDisplayMax = 10;

#-------------------------------------
# 表示件数選択リスト／初期値：10件
#-------------------------------------
$displayNumberList = [10, 20, 30, 50, 100];
$initialDisplayNumber = 10;

#-------------------------------------
# 応募状況：マスター用
#-------------------------------------
#master01_01.php ボタン用
$applicationMasterSetting = [
	'registered' => '登録中',
	'applied' => '応募中',
	'interview' => '面接中',
	'hired' => '採用',
	'rejected' => '不採用',
	'unresponsive' => '連絡待ち'
];
# 応募状況セレクトボックス
$applicationStatusMaster = [
	'registered' => '登録中',
	'applied' => '応募中',
	'interview' => '面接中',
	'hired' => '採用',
	'rejected' => '不採用',
	'unresponsive' => '連絡待ち'
];
#-------------------------------------
# 応募状況：事業所用
#-------------------------------------
#client01_01.php ボタン用
$applicationClientSetting = [
	'applied' => '応募中',
	'interview' => '面接中',
	'hired' => '採用',
	'rejected' => '不採用'
];
# 応募状況セレクトボックス
$applicationStatusClient = [
	'applied' => '応募中',
	'interview' => '面接中',
	'hired' => '採用',
	'rejected' => '不採用'
];
